update
upgrade
 
tap homebrew/versions
tap phinze/homebrew-cask
tap homebrew/binary
tap josegonzalez/php
 
install brew-cask
install zsh
install autojump
install git
install ctags
install tmux
install tig
install ansible
install wget
install curl
install jq
install vim
install boot2docker
install reattach-to-user-namespace
install php55 --with-pgsql --with-pdo-pgsql
install php55-mcrypt php55-xdebug php55-opcache composer

cask install adobe-reader
cask install alfred
cask install appcleaner
cask install appcode
cask install boxer
cask install caffeine
cask install ccleaner
cask install doxygen
cask install dropbox
cask install emacs
cask install evernote
cask install github
cask install heroku-toolbelt
cask install iterm2
cask install java
cask install kobito
cask install mysqlworkbench
cask install navicat-for-mysql
cask install navicat-for-oracle
cask install node
cask install sketch
cask install skydrive
cask install skype
cask install vagrant
cask install virtualbox
cask install zooom
cask install google-chrome
cask install google-japanese-ime
cask install the-unarchiver
cask alfred link # for Alfred

brew 'apple-gcc42'
brew 'curl'
brew 'jpeg'
brew 'pkg-config'
brew 'auto-scaling'
brew 'docker'
brew 'jq'
brew 'ppl011'
brew 'autoconf'
brew 'ec2-ami-tools'
brew 'libgpg-error'
brew 'python'
brew 'autojump'
brew 'ec2-api-tools'
brew 'libiconv'
brew 'rbenv'
brew 'automake'
brew 'elb-tools'
brew 'libksba'
brew 'rds-command-line-tools'
brew 'aws-cfn-tools'
brew 'fontconfig'
brew 'libmpc08'
brew 'readline'
brew 'aws-elasticache'
brew 'fontforge'
brew 'libpng'
brew 'redis'
brew 'aws-elasticbeanstalk'
brew 'freetype'
brew 'libtiff'
brew 'ricty'
brew 'aws-iam-tools'
brew 'fuse4x'
brew 'libtool'
brew 'ruby'
brew 'aws-sns-cli'
brew 'fuse4x-kext'
brew 'libxml2'
brew 'ruby-build'
brew 'bash-completion'
brew 'gcc46'
brew 'libxslt'
brew 's3cmd'
brew 'boot2docker'
brew 'gdbm'
brew 'libyaml'
brew 'scala'
brew 'brew-cask'
brew 'gettext'
brew 'mpfr2'
brew 'sqlite'
brew 'brew-gem'
brew 'gist'
brew 'node'
brew 'tree'
brew 'cloog-ppl015'
brew 'git'
brew 'openssl'
brew 'wget'
brew 'cloud-watch'
brew 'gmp4'
brew 'pcre'
brew 'zsh'